# tasks/task6.py

def solve():
# Ниже пишите решение задачи
    # tasks/task6.py
# Считываем три стороны треугольника
    a, b, c = map(int, input().split())
# Возводим каждую сторону в квадрат для удобства расчетов
    a2 = a ** 2
    b2 = b ** 2
    c2 = c ** 2
# Проверяем теорему Пифагора: квадрат одной стороны равен сумме квадратов двух других.
# Используем оператор "or" для проверки всех трех вариантов.
    result = (a2 == b2 + c2) or (b2 == a2 + c2) or (c2 == a2 + b2)
# Выводим True или False
    print(result)

   
   
# Код ниже не трогать! он нужен для тестов
if __name__ == "__main__":
    solve()