# tasks/task1.py

def solve():
# Ниже пишите решение задачи
    # tasks/task1.py
# Считываем три числа. 
# Используем map(int, input().split()), чтобы разделить строку по пробелам 
# и превратить каждую часть в целое число.
    a, b, c = map(int, input().split())
# Проверяем условие равностороннего треугольника: 
# все стороны должны быть равны между собой (a равно b И b равно c).
    result = (a == b == c)
# Выводим логическое значение (True или False)
    print(result)

    
# Код ниже не трогать! он нужен для тестов
if __name__ == "__main__":
    solve()